Revit 2027 API
ViewPlan.GetUnderlayBaseLevel Method
 Returns the element id of the level that defines the bottom of the underlay range.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId GetUnderlayBaseLevel()
Public Function GetUnderlayBaseLevel As ElementId
public:
ElementId^ GetUnderlayBaseLevel()
member GetUnderlayBaseLevel : unit -> ElementId
Return Value
ElementId
 If InvalidElementId is returned, then the underlay base level is not set and no elements will be displayed as underlay.
See Also
Reference
ViewPlan Class
Autodesk.Revit.DB Namespace